Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ དང་ དགེ་སློང་ གི་ དགེ་འདུན་ དེ་ ལ་ སྐུ་ལུས་ ལ་ གསོལ་ ཏེ །_ |#| གསེར་ གྱི་ རིལ་བ་ བྷྲིང་ གར་ ཐོགས་ ནས་ བཅོམ་ལྡན་འདས་ དེ་ག་ ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཕྱག་ དུ་ ཆུ་ ཕུལ་ ཏེ་ |#| གསོལ་པ །_
en: $1908 “Dṛḍhamati, after having clothed the bodies of the Blessed One and the assembly of monks, the king approached the Blessed One carrying a golden vase, washed the Blessed One’s hands, and said,

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ སྐྱེད་མོས་ཚལ་ འདི་ དང་ གཙུག་ལག་ཁང་ འདི་དག་ དང་ །_ འཆག་ས་ འདི་དག་ དང་ །_ གཟིམས་ ཆ་ འདི་དག་ དང་ །_ ཁྲིའུ་ འདི་དག་ དང་ །_ ཀུན་དགའ་ར་བ་ འདི་དག་ འབུལ་ ལགས་སོ །_།
en: ‘Blessed One, I offer this garden, these rest houses, these promenades, these bedding articles, these seats, and these groves to the Blessed One.

source: རིམ་གྲོ་ དང་ བསྙེན་བཀུར་ བགྱི་བ འི་ སླད་ དུ་ བདག་ཉིད་ ཀྱང་ འབུལ་ ལགས་ སོ །_།
en: To serve and attend you, I also offer myself.’

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ནས་ རྒྱལ་པོ་ དེས་ དེ |#| འི་ རྗེས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ དེ་ ལ་ རིམ་གྲོ་ དང་ བསྙེན་བཀུར་ བྱས་ ཤིང་ ཆོས་ མཉན་པ འི་ ཕྱིར་ཡང་ ཉིན་ གཅིག་ བཞིན་ དུ་ གུས་པ ར་ བྱས་ ནས་ |#| སོང་ ངོ་ །_།
en: $1909 “Dṛḍhamati, thereafter the king continued to serve and attend upon the Thus-Gone One, respectfully following him, just like the first day, in order to listen to the Dharma.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ནས་ རྒྱལ་པོ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ཕྱུག་ དེས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ བསྐལ་པ་ ཕྱེད་ དུ་ རིམ་གྲོ་ བྱས་ ཤིང་ །_ དེ་བཞིན་ གཤེགས་པ་ དེ་ ལ་ གནས་ དང་ གནས་མ་ ཡིན་པ་ དག་ ཀྱང་ ཡོངས་སུ་ དྲིས་ སོ །_།
en: Dṛḍhamati, thus serving that blessed one for half an eon, King Lord of Irreproachable Merit also asked the Thus-Gone One all about what is tenable and what is not.

source: དེ་ཡང་ ཡོངས་སུ་ འདྲི་ ཞིང་ །_ བཅོམ་ལྡན་འདས་ དེ་ཡང་ ལན་ལྡོན་པ་ ན་ སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ འི་ དོན་ བྱས་ སོ །_།
en: Asking him all about such things, the Blessed One offered his response in return, and thereby brought benefit to immeasurable, countless beings. [216.a]

source: བརྟན་པ འི་ བློ་གྲོས་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ རྒྱལ་ [216a] པོ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ཕྱུག་ ཅེས་བྱ་བ་ བྱུང་བ་ དེ་ གཞན་ ཞིག་ ཡིན་པ་ སྙམ་ དུ་ ཁྱོད་ སོམ་ཉི འམ་ ཡིད་གཉིས་ ཟ་བ ར་ གྱུར་ ན
en: $1910 “Dṛḍhamati, if you have any doubt or hesitation, thinking that the king who was then called Lord of Irreproachable Merit was someone else,

source: བརྟན་པ འི་ བློ་གྲོས་ རྒྱལ་པོ་ མ་སྨད་པ འི་ བསོད་ནམས་ དབང་ཕྱུག་ ཅེས་བྱ་བ་ བྱུང་བ་ དེ་ ཁྱོད་ ཉིད་ ཡིན་པ འི་ ཕྱིར་ རོ །_།
en: This is because, Dṛḍhamati, the king called Lord of Irreproachable Merit was none other than you.

source: བརྟན་པ འི་ བློ་གྲོས་ ངས་ ནི་ འདས་པ འི་ དུས་ ན་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ དེ་ཉིད་ ཡོངས་སུ་ དྲི་བ འི་ ཕྱིར་ གང་ ལ་ ཁྱོད་ ཀྱིས་ བླ་ ན་ |#| མེད་པ འི་ རིམ་གྲོ་ དང་ བསྙེན་བཀུར་ བྱས་པ འི་ སངས་རྒྱས་ སྟོང་ ཚང་བ་ བྱུང་བ ར་ མངོན་པར་ ཤེས་ སོ །_།
en: Dṛḍhamati, I remember that in the past there were a full thousand buddhas whom you provided with unexcelled service and attendance in order to ask about this Dharma discourse.

source: བརྟན་པ འི་ བློ་གྲོས་ གང་ཡང་ ཁྱོད་ ཀྱིས་ ཆོས་ ཀྱི་ སྒོ་ སྒྲུབ་ པ་ སྨྲས་པ་ དེ་ དང་ །_ ཇི་ལྟ ར་ ཆོས་ ཀྱི་ སྒོ་ མངོན་པར་ སྒྲུབ་པ་ ཁྱོད་ ལ་ བསྟན་པ ར་ བྱ འོ །_།
en: Dṛḍhamati, I will now teach you regarding your questions on how to accomplish the gateway of Dharma, and how the gateway of Dharma is accomplished.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ ལ་ ཆོས་ ཀྱི་ སྒོ་ ཞེས་ བྱ་བ་ ནི་ གནས་ དང་ གཞི་ རྣམས་ ཡིན་ ཏེ །_
en: $1911 “Dṛḍhamati, the gateways of Dharma are bases and foundations, but

source: དེ་དག་ ནི་ སེམས་པ་ མེད་པ །_ མཚན་མ་ མེད་པ །_ རྩོལ་བ་ མེད་པ །_ དག་པ །_ རྣམ་པར་ དག་པ །_ ཡོངས་སུ་ དག་པ །_ བརྗོད་ དུ་ མེད་པ །_ ཡི་གེ་ མེད་པ །_ ཡི་གེ་ ལས་ རྣམ་པར་ ལོག་པ །_ བསྟན་ དུ་ མེད་པ་ དག་ ཡིན་ ནོ །_།
en: they are devoid of thinking, devoid of characteristics, devoid of effort, pure, completely pure, utterly pure, inexpressible, devoid of syllables, the inverse of syllables, and undemonstrable.

source: བརྟན་པ འི་ བློ་གྲོས་ ཡང་ ཆོས་ ནི་ སྣང་བར་ མི་ འགྱུར་ ཞིང་ །_ ཆོས་ ནི་ ཤེས་པ ས་ རྣམ་པར་ རིག་པ ར་ བྱ་བ་ མ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, phenomena neither appear, nor are they knowable by cognition.

source: བརྟན་པ འི་ བློ་གྲོས་ ཡང་ ཆོས་ ཀྱི་ སྒོ་ ཞེས་ བྱ་བ་ ནི་ དེ་བཞིན་ གཤེགས་པ ས་ མཛད་པ་ གང་ གིས་ མྱ་ངན་ ལས་ འདས་པ་ རབ་ཏུ་ མཁྱེན་པ་ སྟེ །_ |#| ཇི་ལྟ ར་ རབ་ཏུ་ མཁྱེན་པ་ དང་ །_ གང་ གིས་ རབ་ཏུ་ མཁྱེན་པ་ དེ་ ནི་ ངས་ རྣམ་པར་ རིག་པ ར་ བྱ་ མི་ ནུས་ སོ །_།
en: Dṛḍhamati, gateways of Dharma are the deeds by which the thus-gone ones fully understand nirvāṇa, for how they fully understand it, and the means by which they fully understand. |#| They cannot be known by me.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ དེ་དག་ ནི་ རྣམ་པར་ རིག་པ ར་ བྱ་བ་ མ་ ཡིན་ ཞིང་ གདགས་པ་ མ་ཡིན་པ་ དག་ གོ །_།
en: Dṛḍhamati, those phenomena are to be neither known nor designated.

source: བརྟན་པ འི་ བློ་གྲོས་ ཡང་ གང་ལ་ལ ར་ གདགས་ པ འི་ ལམ་ དེ་ ནི་ ཆོས་ ཀྱི་ སྒོ་ ཡིན་ ནོ །_།
en: At the same time, Dṛḍhamati, all the designated paths are the gateways of Dharma.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ རོ་ གཅིག་པ འི་ ཕྱིར་ རྒྱ་མཚོ འི་ རྒྱས་བཏབ་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, since all phenomena are of the same flavor, they bear the seal of the ocean.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ མི་ཟད་པ འི་ མུ་ ཅན་ ཡིན་ ཞིང་ མི་ཟད་པ འི་ མཐའ་ཅན་ ཡིན་པ འི་ ཕྱིར་ ཟད་ མི་ ཤེས་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, since all phenomena have the inexhaustible as their boundary and limit, their end is not known.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ གང་བ་ དང་ བྲི་བ་ མེད་པ ས་ མི་ཟད་པ་ ཉིད་ དུ་ གྱུར་པ་ སྟེ །_
en: Dṛḍhamati, since all phenomena are neither completed nor diminished, they are an inexhaustibility.

source: དེས་ན་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཟད་ མི་ ཤེས་པ འི་ སྒོ་ སྒྲུབ་པ་ ཡང་ འདོགས་པ ར་ མཛད་ དོ །_། |#| སྟོན་པ ར་ མཛད །_ |#| རབ་ཏུ་ འཇོག་པ ར་ མཛད་ དོ །_།
en: That is why the thus-gone ones designate, teach, and establish the accomplishment of the gateway beyond exhaustion.

source: ཆོས་ ཐམས་ཅད་ ནི་ ཨ་ཞེ ས་ བྱ་བ འི་ སྒོ་ ཅན་ ཏེ །_
en: $1912 “All phenomena possess the gate of a , for

source: ཨ་ཞེ ས་ བྱ་བ་ ལ་ འཇུག་པ་ ནི་ རྣམ་པ་ མེད་པ འི་ སྒོ་ [216b] གདགས་པ འི་ བཤད་པ འི་ གནས་ སོ །_།
en: the entrance into a is a point of explanation for designating the gate devoid of attributes. [216.b]

source: དེ་ མངོན་པར་ བསྒྲུབ་པ་ ནི་ མཚམས་ སྦྱོར་བ ར་ བྱེད་པ འོ །_།
en: Accomplishing it is to join with it.

source: དེ་ ལ་ མཚམས་ སྦྱོར་བ འི་ ཡི་གེ་ དག་ གིས་ ཨ་ཞེ ས་ བྱ་བ་ མ་ བྱས་ ཏེ །_
en: The syllables joined with it have not formed a .

source: དེ འི་ ཕྱིར་ ཆོས་ ནི་ ཨ་ཞེ ས་ བྱ་བ་ ཞེས་ བྱ འོ །_།
en: That is why the Dharma is called a .

source: དེ་ ནི་ ཨ་ཞེ ས་ བྱ་བ ས་ རྣམ་པར་ རིག་པ ར་ བྱེད་ ཅིང་ །_
en: It is made known through a , and

source: རྣམ་པར་ རིག་པ་ དེ་ཡང་ དེ འི་ མཚམས་ སྦྱོར་བ འི་ ཚིག་ དང་ ཡི་གེ་ དག་ དང་ ལྡན་པ ར་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱེད་ དོ །_།
en: that knowledge, moreover, is made complete in conjunction with the syllables and words joined with it.

source: དེས་ན་ དེ་བཞིན་ གཤེགས་པ ས་ འདི་སྐད་ དུ་ ཆོས་ ཐམས་ཅད་ ནི་ ཨ་ཞེ ས་ བྱ་བ འི་ སྒོ་ ཅན་ ནོ་ ཞེས་ གསུངས་ སོ །_།
en: Therefore, the thus-gone ones have taught that ‘all phenomena possess a as their gateway.’

source: སྒོ་ དེ་ གང་དག་ གི་ ཡིན་པ འི་ ཆོས་ དེ་དག་ ཀྱང་ གང་ཞེ་ན །_
en: $1913 “What are the phenomena to which that gateway belongs?

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ དེ་དག་ ནི་ མ་ བྱས་པ འོ །_།
en: Dṛḍhamati, those phenomena are unformed.

source: མ་ བྱས་པ་ ནི་ རྣམ་པར་ རིག་པ་ མ་ཡིན་པ ས་ མ་ བཏགས་པ་ རྣམ་པར་ རིག་པ་ མ་ཡིན་པ ར་ རྣམ་པར་ རིག་པ་ བརྗོད་ དུ་ མེད་པར་ བརྗོད་པ །_ མངོན་པར་ བརྗོད་ དུ་ མེད་པར་ མངོན་པར་ བརྗོད་པ །_ ཟད་ མི་ ཤེས་པ ར་ ཟད་པ་ དག་ གོ །_།
en: Since the unformed is unknown, they are known without being designated and known, expressed without being expressible, elucidated without being elucidatable, and exhausted without knowing exhaustion.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ལྟ ར་ ན་ ཨ་ཞེ ས་ བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ ཀྱི་ ལས་ བྱེད་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, thus does a perform the function of all phenomena.

source: རིགས་ ཀྱི་ བུ འམ་ རིགས་ ཀྱི་ བུ་མོ་ སྒོ་ གང་ ལ་ ཞུགས་ པས་ ཡེ་ཤེས་ ཟད་ མི་ ཤེས་ ཤིང་ །_ སྤོབས་པ་ ཟད་ མི་ ཤེས་པ ར་ འགྱུར་བ འི་ སྒོ་ དེ་ ནི་ ཨ་ཞེ ས་ བྱ་བ འི་ སྒོ འོ །_།
en: The gateway though which noble sons and daughters enter to gain wisdom and eloquence beyond exhaustion is the gateway called a.

source: བརྟན་པ འི་ བློ་གྲོས་ མི་ཟད་པ་ ནི་ ཟད་པ་ ལས་ འདས་པ འོ །_།
en: $1914 “Dṛḍhamati, inexhaustible means beyond exhaustion.

source: བརྟན་པ འི་ བློ་གྲོས་ གང་ ལ་ གདགས་པ་ མེད །_ |#| རྣམ་པར་ རིག་པ་ མེད་པ་ ནི་ ཟད་པ་ ཡིན་ ཏེ །_
en: Dṛḍhamati, that which is devoid of designation and knowing is inexhaustible.

source: གང་དག་ རྣམ་པར་ རིག་པ་ མ་ཡིན་པ ར་ རྣམ་པར་ རིག་པ ར་ བྱས་པ་ དེ་དག་ ནི་ རྣམ་པར་ རིག་པ ར་ བྱས་པ་ མ་ ཡིན་ ཞིང་ །_ གང་དག་ བཏགས་པ་ དེ་དག་ ནི་ མ་ བཏགས་པ་ སྟེ །_
en: Those that are made known without being known are not made known, and those that are designated are not designated—

source: བརྟན་པ འི་ བློ་གྲོས་ དེས་ན་ སྒོ་ དེ་ ནི་ ཟད་པ་ ཞེས་ བྱ འོ །_།
en: thus, Dṛḍhamati, is that gateway called inexhaustible.

source: སྒོ་ དེ་ གང་ གི་ ཡིན་ ཞེ་ན །_
en: $1915 “To what does that gateway belong?

source: ཆོས་ དེ་དག་ གི་ སྒོ འོ །_།
en: It is the gateway of those phenomena.

source: གང་དག་ གི་ ཞེ་ན །_
en: Of which ones?

source: གང་ དག་ དེ་བཞིན་ གཤེགས་པ ས་ མ་ བརྙེས་ མ་ དམིགས་པ འོ །_།
en: Those that are neither found, nor perceived by the thus-gone ones.

source: བརྟན་པ འི་ བླ་ གྲོས་ སྒོ་ ཞེས་ བྱ་བ་ ནི་ ཕྱིར་ མི་ ལྡོག་པ་ སྟེ །_
en: $1916 “Dṛḍhamati, gateway means irreversible, for

source: འཇུག་པ་ དེ་ ནི་ ཆོས་ ཐམས་ཅད་ ཀྱི་ ཡིན་ ནོ །_།
en: that entrance is into all phenomena.

source: མངོན་པར་ བརྗོད་པ་ ཐམས་ཅད་ ཀྱང་ མངོན་པར་ བརྗོད་ དུ་ མེད་པ་ ཡིན །_
en: All that is elucidated is unelucidatable.

source: ངག་ ཐམས་ཅད་ ཀྱང་ མི་ཟད་པ འི་ ངག་ ཡིན །_
en: All speech is speech of the inexhaustible.

source: ངག་ ཐམས་ཅད་ ཀྱང་ དེ་བཞིན་ གྱི་ ངག་ ཡིན །_ |#| གཞན་མ་ ཡིན་པ འི་ ངག་ ཡིན །_
en: All speech is the speech of precisely that, and no other.

source: རྣམ་པར་ རིག་པ་ ཐམས་ཅད་ ཀྱང་ རྣམ་པར་ རིག་པ་ མ་ཡིན་པ་ ཡིན་ ཏེ །_
en: All that is known is not known, and

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ནི་ རྡོ་རྗེ འི་ ཚིག་ གོ །_།
en: this, Dṛḍhamati, is a vajra statement.

source: ཅིའི་ཕྱིར་ རྡོ་རྗེ འི་ ཚིག་ ཅེས་ བྱ་ ཞེ་ན །_
en: Why is it called a vajra statement ?

source: གང་ ལ་ ཡང་ ནམ་ཡང་ དབྱེར་ མེད་ ཅིང་ གང་ ལ་ ཡང་ དབྱེར་ མེད་པ་ དེ་ ལ་ བྱེད་པ་པོ་ གང་ཡང་ མེད་ ལ །_
en: Because it is never divisible, and being utterly indivisible, it is devoid of any agent. [217.a]

source: གང་ [217a] ལ་ བྱེད་པ་པོ་ གང་ཡང་ མེད་པ ས་ དེས་ན་ རྡོ་རྗེ འི་ ཚིག་ ཅེས་ བྱ འོ །_།
en: Thus lacking any agent whatsoever, it is called a vajra statement.

source: ཆོས་ ཐམས་ཅད་ ནི་ལ ས་ མེད་པ་ སྟེ །_
en: $1917 “All phenomena are devoid of action.

source: གང་ ལས་ མེད་པ་ ཉིད་ དེ་ ལ་ ནི་ རྣམ་པར་ སྨིན་པ་ གང་ཡང་ མེད་ ལ །_
en: Where there is no action there is also absolutely no maturation.

source: གང་ ལ་ རྣམ་པར་ སྨིན་པ་ གང་ཡང་ མེད་པ ས་ དེས་ན་ ཆོས་ ཐམས་ཅད་ ནི་ལ ས་ མེད་པ་ རྣམ་པར་ སྨིན་པ་ མེད་པ་ ཞེས་ བྱ འོ །_།
en: Since they thus lack any maturation at all, all phenomena are therefore said to be devoid of action and devoid of maturation.

source: ཆོས་ ཀྱི་ ཕྱག་རྒྱ་ དེ་ ནི་ གང་ལ་ལ ར་ དེ་བཞིན་ གཤེགས་པ ས་ ལས་ ཀྱི་ རྣམ་པར་ སྨིན་པ་ བསྟན་པ་ དེ འི་ ཚེ་ ན་ ཆོས་ ཀྱི་ ཕྱག་རྒྱ་ དེས་ བསྟན་པ འོ །_།
en: Regarding the seal of the Dharma, when thus-gone ones teach the maturation of actions with respect to certain things, this is taught through the seal of the Dharma.

source: ཕྱག་རྒྱ་ དེ་ ནི་ མ་ བྱས་པ་ དང་ དབྱེར་ མེད་པར་ ཁོང་ དུ་ ཆུད་པ ར་ བྱ འོ །_།
en: That seal should be understood as unformed and undivided.

source: བརྟན་པ འི་ བློ་གྲོས་ རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ ལས་ ཀྱི་ རྣམ་པར་ སྨིན་པ་ ལ་ འཇུག་པ ར་ འདོད་ པ ས་ ནི་ དེ་ལྟ ར་ འཇུག་པ ར་ བྱ འོ །_།
en: Dṛḍhamati, noble sons and daughters who wish to engage in the maturation of actions should thus engage in it.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ ནམ་མཁའ་ ལ་ འཇུག་པ ས་ འོང་བ་ མེད་པ །_ འགྲོ་བ་ མེད་པ་ ཡིན་ ནོ །_།
en: $1918 “Dṛḍhamati, since all phenomena emerge in space, they are beyond coming and going.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ ས་ ནི་ སྒོ་ དེ་ ལ་ བརྟེན་ ནས་ སེམས་ཅན་ རྣམས་ ཀྱི་ འཆི་ འཕོ་ དང་ སྐྱེ་བ་ རབ་ཏུ་ མཁྱེན་ ཏོ །_།
en: Dṛḍhamati, it is based on that gateway that thus-gone ones fully know the deaths and births of beings.

source: བརྟན་པ འི་ བློ་གྲོས་ རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ འཆི་ འཕོ་ དང་ སྐྱེ་བ་ ལ་ འཇུག་པ ར་ འདོད་པ ས་ ནི་ ཕྱག་རྒྱ་ དེ་ ལ་ འཇུག་པ ར་ བྱ འོ །_།
en: Dṛḍhamati, noble sons and daughters who wish to penetrate death and birth should enter that seal.

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ནི་ ཆོས་ རྣམས་ ཀྱི་ ཡི་གེ་ མེད་པ འི་ ཕྱག་རྒྱ་ ཡིན་ ནོ །_། |#| གདགས་པ་ མེད་པ འི་ ཕྱག་རྒྱ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, this is the seal of the absence of syllables and the absence of designation of any phenomena.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀྱིས་ ཇི་ཙམ་ དུ་ མངོན་པར་ བརྗོད་པ་ ཐམས་ཅད་ ནི་ ཕྱག་རྒྱ་ དེས་ མངོན་པར་ བརྗོད་པ ར་ མཛད་ ཅིང་ ཕྱག་རྒྱ་ དེ་ཉིད་ མངོན་པར་ བརྗོད་པ ར་ མཛད་ དོ །_།
en: Dṛḍhamati, the full range of everything verbally elucidated by the thus-gone ones, the worthy ones, the perfect buddhas is elucidated by that seal and also elucidates that very same seal.

source: བརྟན་པ འི་ བློ་གྲོས་ ལུས་ ཐམས་ཅད་ ནི་ དེ་བཞིན་ གཤེགས་པ འི་ སྐུ འོ །_།
en: $1919 “Dṛḍhamati, all ordinary bodies are the awakened body of a thus-gone one.

source: འདི་ལྟར་ སྐུ་ དེ་ ནི་ ལུས་ ཀྱི་ སྐུ་ ཡིན་ ཞིང་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཕྱག་རྒྱ་ དེས་ སེམས་ཅན་ རྣམས་ ཀྱི་ ལུས་ མངོན་པར་ སྒྲུབ་པ་ སྟོན་པ ར་ མཛད་པ འི་ ཕྱིར་ རོ །_།
en: This is because that awakened body is the awakened body of ordinary bodies, and a thus-gone one demonstrates the formation of beings’ ordinary bodies by means of that seal.

source: བརྟན་པ འི་ བློ་གྲོས་ ཕྱག་རྒྱ་ གང་ གིས་ བཏབ་པ འི་ ལུས་ ཀྱི་ ཕྱག་རྒྱ་ དེ་ ནི་ ལུས་ ཐམས་ཅད་ ཀྱི་ གདགས་པ འོ །_།
en: Dṛḍhamati, the seal by which the ordinary body is sealed is the designation of all ordinary bodies.

source: བརྟན་པ འི་ བློ་གྲོས་ གང་ལ་ལ ར་ ལུས་ མངོན་པར་ བསྒྲུབ་པ་ དེ་ ཐམས་ཅད་ ནི་ ཕྱག་རྒྱ་ དེས་ བཏབ་པ་ ཡིན་ ཞིང་
en: Dṛḍhamati, everyone whose body is formed is sealed by that seal, and

source: དེ་བཞིན་ གཤེགས་པ་ ནི་ ཕྱག་རྒྱ་ དེ་ཉིད་ མངོན་པར་ སྒྲུབ་པ ར་ མཛད་ དོ །_།
en: a thus-gone one has accomplished that very same seal.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ འཇུག་པ་ མེད་པ འི་ ཕྱིར་ སྒོ་ མེད་པ་ ཡིན་ ནོ །_།
en: $1920 “Dṛḍhamati, since all phenomena have no entrance, they have no gateway.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ འགྲོ་བ་ མེད་པ འི་ ཕྱིར་ འཇུག་པ་ མེད་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, since all phenomena have no going, they have no entrance.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ འཇུག་པ་ [217b] མེད་པ་ ཉིད་ ཀྱི་ ཕྱིར་ འགྲོ་བ་ མེད་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, since all phenomena have no entrance, they have no going. [217.b]

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ་ ནི་ གང་དང་གང་ ནས་ ཆོས་སྟོན་པ་ དེ་ དང་ དེ་ནས་ ཆགས་པ་ མེད་པ འི་ མུ་ དང་ ལྡན་པ་ ཁོ་ན་ དག་ སྟོན་པ ར་ མཛད་ ཅིང་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ མུ་ དེ་ཉིད་ ཀྱང་ རབ་ཏུ་ མཁྱེན་ ཏེ |#| མུ་ དེ་ ནི་ དེ་ལྟ་ བུ་ ཡིན་ ནོ །_།
en: $1921 “Dṛḍhamati, however the thus-gone ones teach the Dharma, they teach only those who are of the unobstructed nature and they also know full well that that very same nature belongs to all beings, for their nature is like that.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆགས་པ་ མེད་པ འི་ མུ་ ཞེས་ བྱ་བ་ ནི་ མཐའ་ཡས་པ འི་ མུ་ སྟེ །_
en: Dṛḍhamati, the so-called unobstructed nature refers to the nature of the infinite.

source: སེམས་ཅན་ ཐམས་ཅད་ ནི་ ཡ་མ་བརླ འི་ མུ ར་ བསྟན་པ ས་ དེ་ལྟ་ བུ འི་ མུ་ ཅན་ ཡིན་ ནོ །_།
en: Since all beings are taught to be of that empty nature, they possess just such a nature.

source: བརྟན་པ འི་ བློ་གྲོས་ གང་ དུ་ ཆོས་ ཐམས་ཅད་ ཀྱི་ སྒོ་ མུ འི་ སྒོ་ དེས་ མུ འི་ སྒོ་ ཡིན་པ་ དེ་ ཐམས་ཅད་ ནི་ ཆོས་ ཀྱི་ ཕུང་པོ་ ཡིན་ ལ་
en: $1922 “Dṛḍhamati, with that gateway of the nature being the gateway of all phenomena, everything that is the gateway of the nature comprises the aggregate of phenomena. |#| However,

source: ཆོས་ ཀྱི་ ཕུང་པོ་ ཡང་ ཕུང་པོ་ མེད་པ་ སྟེ །_
en: the aggregate of phenomena also lacks an aggregate.

source: དེ་ ལྟ ར་ ཕུང་པོ་ དེ་དག་ ནི་ ཕུང་པོ་ མེད་པ་ ཡིན་ ཞིང་ ཕུང་པོ་ དེ་དག་ ནི་ ཆོས་ ཀྱི་ ཕུང་པོ་ ཡང་ ཡིན་ ནོ །_།
en: With those aggregates thus lacking aggregates, those aggregates too are aggregates of phenomena.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ་ ནི་ གང་དང་གང་ ནས་ ཕུང་པོ་ དག་ སྟོན་པ་ དེ་ དང་ དེ་ནས་ ཆོས་ ཀྱི་ ཕུང་པོ འི་ སྒོ་ མུ་ དེས་ སྟོན་པ ར་ མཛད་ དོ །_།
en: Dṛḍhamati, from whichever perspective the thus-gone ones teach the aggregates, they teach this topic through that threshold of the aggregate of phenomena.

source: གཟུགས་ ཀྱི་ ཕུང་པོ་ དང་ །_ ཚོར་བ འི་ ཕུང་པོ་ དང་ །_ འདུ་ཤེས་ ཀྱི་ ཕུང་པོ་ དང་ །_ འདུ་བྱེད་ ཀྱི་ ཕུང་པོ་ དང་ །_ རྣམ་པར་ ཤེས་པ འི་ ཕུང་པོ་ སྟེ་ ཕུང་པོ་ རྣམས་ ནི་ ཕུང་པོ་ མེད་པ་ ཡིན་ ནོ །_།
en: The aggregates of form, feeling, perception, formation, and consciousness are without aggregates.

source: འདི་ ནི་ ཕུང་པོ་ རྣམས་ ཀྱི་ རྣམ་པ འི་ སྒོ་ བསྟན་པ འོ །_།
en: This is taught as the gateway to the attributes of the aggregates.”

source: བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བརྟན་པ འི་ བློ་གྲོས་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $1923 The bodhisattva great being Dṛḍhamati then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་ ཆོས་ རྣམས་ ཀྱི་ འཇུག་པ་ དེ་ ནི་ ཟབ་ ལགས་སོ །_།
en: “Blessed One, that entrance to phenomena is profound.”

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ་ ནི་ འདི་ སྙམ་ དུ་ འདི་ ནི་ ཟབ་པ འོ །_། |#| འདི་ ནི་ གསལ་བ འོ་ སྙམ་ དུ་ མི་ དགོངས་ ཏེ །_
en: $1924 “Dṛḍhamati,” |#| “the thus-gone ones do not think, ‘This is profound. |#| This is lucid.’

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཅུང་ཟད་ ཅིག་ སྟོན་པ ར་ མཛད་ དོ །_།
en: Dṛḍhamati, the thus-gone ones only teach a little.”

source: ཇི་ལྟ ར་ བྱིས་པ་ རྣམས་ ཀྱིས་ བཟུང་བ་ དེ་ལྟ ར་ ནི་ སྟོན་པ ར་ མི་ མཛད་ ཀྱི་ ཇི་ལྟ ར་ མཁས་པ་ རྣམས་ ཀྱིས་ ཀུན་ འཚལ་བ་ དེ་ལྟ ར་ གསུངས་ ཏེ །_
en: $1925 “They do not teach according to what is apprehended by the immature,” |#| “Rather, they teach according to what is known by the wise.

source: དེ་བཞིན་ གཤེགས་པ་ ནི་ དེ་ལྟ ར་ ཆོས་སྟོན་ པར་ མཛད་ ལགས་སོ །_།
en: That is how the thus-gone ones teach the Dharma.”

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཇི་ལྟ ར་ རབ་ཏུ་ ཤེས་པ་ དེ་ལྟ ར་ སྟོན་པ ར་ མི་ བྱེད །_ |#| འདོགས་པ ར་ མི་ བྱེད །_ |#| རབ་ཏུ་ འཇོག་པ ར་ མི་ བྱེད་ དོ །_།
en: $1926 “Dṛḍhamati,” |#| “the thus-gone ones do not teach, designate, or posit in accordance with their complete understanding.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ དེ་ལྟ ར་ མཁས་པ་ རྣམས་ ཀྱིས་ ཀུན་ཤེས་པ་ ཡིན་ ཞིང་ །_ ཇི་ལྟ ར་ བྱིས་པ་ རྣམས་ ཀྱིས་ བཟུང་བ་ དེ་ལྟ ར་ [218a] ནི་ ཡི་གེ འི་ རྣམ་པར་ རིག་པ་ ཡིན་ ལ །_ ཡི་གེ་ དེ་དག་ ཀྱང་ ཡི་གེ་ མེད་པ་ ཡིན་པ ས་ བསྟན་པ་ མེད་པ འི་ ཕྱིར་ རོ །_།
en: This is because, Dṛḍhamati, while all phenomena are fully known by the wise, the knowledge of syllables accords with how the immature apprehend. [218.a] Moreover, since those syllables are also devoid of syllables, there is no teaching.”

source: གཞན་ ཡང་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བརྟན་པ འི་ བློ་གྲོས་ ལ་ བཀའ་ སྩལ་པ །_
en: $1927 The Blessed One then continued what he was saying to Dṛḍhamati:

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ ཉི་མ འི་ དཀྱིལ་འཁོར་ གྱི་ སྣང་བ་ ཡིན་ ནོ །_།
en: “Dṛḍhamati, all phenomena are the light of the orb of the sun.

source: བརྟན་ པ འི་ བློ་གྲོས་ གང་དང་གང་ ནས་ ཆོས་ ལ་ ཚུལ་བཞིན་ དུ་ སོ་སོ ར་ རྟོག་པ་ དེ་ དང་ དེ་ནས་ མཐའ་ཡས་པ འི་ མུ་ ཅན་ ཁོ་ན ར་ སྣང་ སྟེ །_
en: Dṛḍhamati, from whichever perspective phenomena are perfectly discerned, they appear to exclusively possess the nature of the infinite.

source: དེ་ལྟ ར་ དེ་དག་ ནི་ ཆོས་ ཀྱི་ སྣང་བ་ ཡིན་ ནོ །_།
en: It is in this sense that they are the light of the Dharma.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ ཀུན་ ནས་ སྣང་བ་ དང་ སྒྲིབ་པ་ མེད་པ འི་ ཕྱིར་ འོད་གསལ་བ་ ཡིན་ ནོ །_།
en: $1928 “Dṛḍhamati, since all phenomena are fully illuminated and free of obstruction, they are luminous.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ གང་ གིས་ ཀྱང་ མ་ བསྒྲིབས་པ འི་ ཕྱིར་ སྒྲིབ་པ་ མེད་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, since all phenomena are unobstructed by anything whatsoever, they have no obstruction.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ བླ་གབ་ མེད་པ་ དང་ མཚུངས་པ འི་ ཕྱིར་ མ་ བསྒྲིབས་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, since all phenomena are like open space, they are unobstructed.

source: བརྟན་པ འི་ བློ་གྲོས་ གང་ ན་ གཉིས་ གདགས་པ་ དང་ གཉིས་ འཛིན་པ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ འི་ སྤྱན་ སྒྲིབ་པ་ མེད་པ་ འཇུག་ གོ །_།
en: Dṛḍhamati, the unobstructed vision of the thus-gone ones penetrates wherever there is dualistic designation and dualistic apprehending.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ ས་ མིག་གང་ གིས་ ཆོས་ ཐམས་ཅད་ རབ་ཏུ་ ཤེས་ ཤིང་ ཇི་ལྟ ར་ རབ་ཏུ་ ཤེས་པ་ དེ་ལྟ ར་ སྒྲིབ་པ་ མེད་པར་ རབ་ཏུ་ ཤེས་པ་ འདི་ ནི་ མིག་ གི་ ཆོས་ ཡིན་ ནོ །_།
en: Dṛḍhamati, this unobstructed perfect knowing, in which the thus-gone ones perfectly know all phenomena through their vision, is the Dharma of vision.

source: བརྟན་པ འི་ བློ་གྲོས་ རིགས་ ཀྱི་ བུས་ གང་ ལ་ བརྟེན་ ནས་ |#| དོན་ ལ་ ངེས་པ ར་ རྟོག་པ འི་ བརྗོད་པ་ འབྱུང་བ་ དང་ །_ ཟབ་མོ་ བསྟན་པ འི་ བརྗོད་པ་ འབྱུང་བ་ དང་ །_ མ་ཆགས་པ འི་ བརྗོད་པ་ འབྱུང་བ འི་ ཆོས་ ཐམས་ཅད་ ཀྱི་ སྒོ་ དེ་ ནི་ སྒྲིབ་པ་ མེད་པ འི་ སྒོ་ ཡིན་ ནོ །_།
en: $1929 “Dṛḍhamati, through the gateway of all phenomena emerge expressions that cause noble sons to discern the meaning, expressions based on which they teach the profound, and expressions that are unimpeded. |#| This is also the unobstructed gateway.”

source: གཞན་ ཡང་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྟན་པ འི་ བློ་གྲོས་ ལ་ བཀའ་ སྩལ་པ །_
en: the Blessed One continued to explain to the bodhisattva Dṛḍhamati,

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ ཆགས་པ་ མེད་ ཅིང་ ཆགས་ པ་ དང་ བྲལ་བ འི་ ཕྱིར་ རྡུལ་ དང་ བྲལ་བ་ ཡིན་ ནོ །_།
en: $1930 “Dṛḍhamati,” |#| “since all phenomena are without impediment and free of impediment, they are free of stains.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ ཕན་ འདོགས་པ་ མེད་པ འི་ ཚུལ་ གྱིས་ ཡོངས་སུ་ མ་ བཟུང་བ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, being without benefit, all phenomena are devoid of being received.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ ནི་ དངོས་པོ་ དམིགས་ སུ་ མེད་པ ས་ མཐའ་ ཡ ས་ མུ་མེད་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, since no phenomenon can be apprehended as an object, all phenomena are infinite and boundless.

source: བརྟན་པ འི་ བློ་གྲོས་ གང་དང་གང་ དུ་ ཡི་གེ འི་ བསྟན་པ་ སྟོན་པ་ དེ་ དང་ དེར་ ནི་ ཆོས་ ཐམས་ཅད་ ཡི་གེ་ མེད་པ་ ཁོ་ན ར་ སྟོན་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, wherever a teaching with syllables is taught, all that is taught there is that all phenomena are devoid of syllables.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ དེ་དག་ གི་ མཐའ་ ཐུག་པ་ མེད་པ་ དང་ །_ མཐར་ཐུག་པ་ མེད་པ་ བསྟན་པ ས་ ཇི་ལྟ ར་ སུ་ཞིག་ ཡི་གེ་ མེད་པ འི་ སྒོ་ དེ་ ལ་ འཇུག་ སྟེ །_ |#| འདི་ ནི་ དེ འི་ འཇུག་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, since all phenomena are without boundary and are taught to be without boundary, whenever someone enters the gateway beyond syllables, this is their entrance.

source: འཇུག་པ་ དེ་ ནི་ ཆོས་ གང་ གི་ ཡང་འཇུག་པ་ [218b] མ་ ཡིན་ ནོ །_།
en: That entrance is not an entrance into any phenomena whatsoever. [218.b]

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ ས་ ནི་ ཏིང་ངེ་འཛིན་ གྱི་ སྒོ་ སྒྲུབ་པ་ གསུངས་ ཏེ །_
en: $1931 “Dṛḍhamati, the thus-gone ones have taught on the accomplishment of the gateway of absorption.

source: ཏིང་ངེ་འཛིན་ གྱི་ སྒྲུབ་པ་ ཡང་ གང་ཞེ་ན །_
en: What is the accomplishment of absorption?

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཐམས་ཅད་ བཀོད་པ་ ཚུལ་ གཅིག་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ཡོད་ དོ །_།
en: Dṛḍhamati, there is an absorption called array of all phenomena in a single mode .

source: བཀོད་པ་ དུ་མ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ཡོད་ དོ །_།
en: And there is an absorption called multiple array.

source: དེ་ ལ་ བཀོད་པ་ གཅིག་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ གང་ཞེ་ན །_
en: $1932 “What, then, is the absorption called the single array ?
